Revit 2024 API
TaskDialogCommonButtons Enumeration
A enumerated type containing the standard buttons available for Task Dialogs.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
[FlagsAttribute]
public enum TaskDialogCommonButtons
Visual Basic
<FlagsAttribute> _
Public Enumeration TaskDialogCommonButtons
Visual C++
[FlagsAttribute]
public enum class TaskDialogCommonButtons
Members
Member name | Description
None | No common button.
Ok | OK button.
Yes | Yes button.
No | No button.
Cancel | Cancel button.
Retry | Retry button.
Close | Close button.
See Also
Autodesk.Revit.UI Namespace